GopalSaraf/Practicals/PSDL/include/proc/pic18f1330.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F1330_INC_
#define _PIC18F1330_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F1330
 */

/*
 * Device Registers
 */

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_RA6_POSN                           equ 0006h
PORTA_RA6_POSITION                       equ 0006h
PORTA_RA6_SIZE                           equ 0001h
PORTA_RA6_LENGTH                         equ 0001h
PORTA_RA6_MASK                           equ 0040h
PORTA_RA7_POSN                           equ 0007h
PORTA_RA7_POSITION                       equ 0007h
PORTA_RA7_SIZE                           equ 0001h
PORTA_RA7_LENGTH                         equ 0001h
PORTA_RA7_MASK                           equ 0080h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_TX_POSN                            equ 0002h
PORTA_TX_POSITION                        equ 0002h
PORTA_TX_SIZE                            equ 0001h
PORTA_TX_LENGTH                          equ 0001h
PORTA_TX_MASK                            equ 0004h
PORTA_RX_POSN                            equ 0003h
PORTA_RX_POSITION                        equ 0003h
PORTA_RX_SIZE                            equ 0001h
PORTA_RX_LENGTH                          equ 0001h
PORTA_RX_MASK                            equ 0008h
PORTA_AN2_POSN                           equ 0004h
PORTA_AN2_POSITION                       equ 0004h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0010h
PORTA_MCLR_POSN                          equ 0005h
PORTA_MCLR_POSITION                      equ 0005h
PORTA_MCLR_SIZE                          equ 0001h
PORTA_MCLR_LENGTH                        equ 0001h
PORTA_MCLR_MASK                          equ 0020h
PORTA_OSC2_POSN                          equ 0006h
PORTA_OSC2_POSITION                      equ 0006h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0040h
PORTA_OSC1_POSN                          equ 0007h
PORTA_OSC1_POSITION                      equ 0007h
PORTA_OSC1_SIZE                          equ 0001h
PORTA_OSC1_LENGTH                        equ 0001h
PORTA_OSC1_MASK                          equ 0080h
PORTA_INT0_POSN                          equ 0000h
PORTA_INT0_POSITION                      equ 0000h
PORTA_INT0_SIZE                          equ 0001h
PORTA_INT0_LENGTH                        equ 0001h
PORTA_INT0_MASK                          equ 0001h
PORTA_INT1_POSN                          equ 0001h
PORTA_INT1_POSITION                      equ 0001h
PORTA_INT1_SIZE                          equ 0001h
PORTA_INT1_LENGTH                        equ 0001h
PORTA_INT1_MASK                          equ 0002h
PORTA_CK_POSN                            equ 0002h
PORTA_CK_POSITION                        equ 0002h
PORTA_CK_SIZE                            equ 0001h
PORTA_CK_LENGTH                          equ 0001h
PORTA_CK_MASK                            equ 0004h
PORTA_DT_POSN                            equ 0003h
PORTA_DT_POSITION                        equ 0003h
PORTA_DT_SIZE                            equ 0001h
PORTA_DT_LENGTH                          equ 0001h
PORTA_DT_MASK                            equ 0008h
PORTA_T0CKI_POSN                         equ 0004h
PORTA_T0CKI_POSITION                     equ 0004h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0010h
PORTA_CLKO_POSN                          equ 0006h
PORTA_CLKO_POSITION                      equ 0006h
PORTA_CLKO_SIZE                          equ 0001h
PORTA_CLKO_LENGTH                        equ 0001h
PORTA_CLKO_MASK                          equ 0040h
PORTA_CLKI_POSN                          equ 0007h
PORTA_CLKI_POSITION                      equ 0007h
PORTA_CLKI_SIZE                          equ 0001h
PORTA_CLKI_LENGTH                        equ 0001h
PORTA_CLKI_MASK                          equ 0080h
PORTA_KBI0_POSN                          equ 0000h
PORTA_KBI0_POSITION                      equ 0000h
PORTA_KBI0_SIZE                          equ 0001h
PORTA_KBI0_LENGTH                        equ 0001h
PORTA_KBI0_MASK                          equ 0001h
PORTA_KBI1_POSN                          equ 0001h
PORTA_KBI1_POSITION                      equ 0001h
PORTA_KBI1_SIZE                          equ 0001h
PORTA_KBI1_LENGTH                        equ 0001h
PORTA_KBI1_MASK                          equ 0002h
PORTA_VREFP_POSN                         equ 0004h
PORTA_VREFP_POSITION                     equ 0004h
PORTA_VREFP_SIZE                         equ 0001h
PORTA_VREFP_LENGTH                       equ 0001h
PORTA_VREFP_MASK                         equ 0010h
PORTA_T1OSO_POSN                         equ 0006h
PORTA_T1OSO_POSITION                     equ 0006h
PORTA_T1OSO_SIZE                         equ 0001h
PORTA_T1OSO_LENGTH                       equ 0001h
PORTA_T1OSO_MASK                         equ 0040h
PORTA_T1OSI_POSN                         equ 0007h
PORTA_T1OSI_POSITION                     equ 0007h
PORTA_T1OSI_SIZE                         equ 0001h
PORTA_T1OSI_LENGTH                       equ 0001h
PORTA_T1OSI_MASK                         equ 0080h
PORTA_NOT_MCLR_POSN                      equ 0005h
PORTA_NOT_MCLR_POSITION                  equ 0005h
PORTA_NOT_MCLR_SIZE                      equ 0001h
PORTA_NOT_MCLR_LENGTH                    equ 0001h
PORTA_NOT_MCLR_MASK                      equ 0020h
PORTA_CMP0_POSN                          equ 0000h
PORTA_CMP0_POSITION                      equ 0000h
PORTA_CMP0_SIZE                          equ 0001h
PORTA_CMP0_LENGTH                        equ 0001h
PORTA_CMP0_MASK                          equ 0001h
PORTA_nMCLR_POSN                         equ 0005h
PORTA_nMCLR_POSITION                     equ 0005h
PORTA_nMCLR_SIZE                         equ 0001h
PORTA_nMCLR_LENGTH                       equ 0001h
PORTA_nMCLR_MASK                         equ 0020h
PORTA_AN3_POSN                           equ 0006h
PORTA_AN3_POSITION                       equ 0006h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0040h
PORTA_T1CKI_POSN                         equ 0006h
PORTA_T1CKI_POSITION                     equ 0006h
PORTA_T1CKI_SIZE                         equ 0001h
PORTA_T1CKI_LENGTH                       equ 0001h
PORTA_T1CKI_MASK                         equ 0040h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h
PORTA_LVDIN_POSN                         equ 0005h
PORTA_LVDIN_POSITION                     equ 0005h
PORTA_LVDIN_SIZE                         equ 0001h
PORTA_LVDIN_LENGTH                       equ 0001h
PORTA_LVDIN_MASK                         equ 0020h
PORTA_RJPU_POSN                          equ 0007h
PORTA_RJPU_POSITION                      equ 0007h
PORTA_RJPU_SIZE                          equ 0001h
PORTA_RJPU_LENGTH                        equ 0001h
PORTA_RJPU_MASK                          equ 0080h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB0_POSN                           equ 0000h
PORTB_RB0_POSITION                       equ 0000h
PORTB_RB0_SIZE                           equ 0001h
PORTB_RB0_LENGTH                         equ 0001h
PORTB_RB0_MASK                           equ 0001h
PORTB_RB1_POSN                           equ 0001h
PORTB_RB1_POSITION                       equ 0001h
PORTB_RB1_SIZE                           equ 0001h
PORTB_RB1_LENGTH                         equ 0001h
PORTB_RB1_MASK                           equ 0002h
PORTB_RB2_POSN                           equ 0002h
PORTB_RB2_POSITION                       equ 0002h
PORTB_RB2_SIZE                           equ 0001h
PORTB_RB2_LENGTH                         equ 0001h
PORTB_RB2_MASK                           equ 0004h
PORTB_RB3_POSN                           equ 0003h
PORTB_RB3_POSITION                       equ 0003h
PORTB_RB3_SIZE                           equ 0001h
PORTB_RB3_LENGTH                         equ 0001h
PORTB_RB3_MASK                           equ 0008h
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_PWM0_POSN                          equ 0000h
PORTB_PWM0_POSITION                      equ 0000h
PORTB_PWM0_SIZE                          equ 0001h
PORTB_PWM0_LENGTH                        equ 0001h
PORTB_PWM0_MASK                          equ 0001h
PORTB_PWM1_POSN                          equ 0001h
PORTB_PWM1_POSITION                      equ 0001h
PORTB_PWM1_SIZE                          equ 0001h
PORTB_PWM1_LENGTH                        equ 0001h
PORTB_PWM1_MASK                          equ 0002h
PORTB_INT2_POSN                          equ 0002h
PORTB_INT2_POSITION                      equ 0002h
PORTB_INT2_SIZE                          equ 0001h
PORTB_INT2_LENGTH                        equ 0001h
PORTB_INT2_MASK                          equ 0004h
PORTB_INT3_POSN                          equ 0003h
PORTB_INT3_POSITION                      equ 0003h
PORTB_INT3_SIZE                          equ 0001h
PORTB_INT3_LENGTH                        equ 0001h
PORTB_INT3_MASK                          equ 0008h
PORTB_PWM2_POSN                          equ 0004h
PORTB_PWM2_POSITION                      equ 0004h
PORTB_PWM2_SIZE                          equ 0001h
PORTB_PWM2_LENGTH                        equ 0001h
PORTB_PWM2_MASK                          equ 0010h
PORTB_PWM3_POSN                          equ 0005h
PORTB_PWM3_POSITION                      equ 0005h
PORTB_PWM3_SIZE                          equ 0001h
PORTB_PWM3_LENGTH                        equ 0001h
PORTB_PWM3_MASK                          equ 0020h
PORTB_PWM4_POSN                          equ 0006h
PORTB_PWM4_POSITION                      equ 0006h
PORTB_PWM4_SIZE                          equ 0001h
PORTB_PWM4_LENGTH                        equ 0001h
PORTB_PWM4_MASK                          equ 0040h
PORTB_PWM5_POSN                          equ 0007h
PORTB_PWM5_POSITION                      equ 0007h
PORTB_PWM5_SIZE                          equ 0001h
PORTB_PWM5_LENGTH                        equ 0001h
PORTB_PWM5_MASK                          equ 0080h
PORTB_KBI2_POSN                          equ 0002h
PORTB_KBI2_POSITION                      equ 0002h
PORTB_KBI2_SIZE                          equ 0001h
PORTB_KBI2_LENGTH                        equ 0001h
PORTB_KBI2_MASK                          equ 0004h
PORTB_KBI3_POSN                          equ 0003h
PORTB_KBI3_POSITION                      equ 0003h
PORTB_KBI3_SIZE                          equ 0001h
PORTB_KBI3_LENGTH                        equ 0001h
PORTB_KBI3_MASK                          equ 0008h
PORTB_PGC_POSN                           equ 0006h
PORTB_PGC_POSITION                       equ 0006h
PORTB_PGC_SIZE                           equ 0001h
PORTB_PGC_LENGTH                         equ 0001h
PORTB_PGC_MASK                           equ 0040h
PORTB_PGD_POSN                           equ 0007h
PORTB_PGD_POSITION                       equ 0007h
PORTB_PGD_SIZE                           equ 0001h
PORTB_PGD_LENGTH                         equ 0001h
PORTB_PGD_MASK                           equ 0080h
PORTB_CMP2_POSN                          equ 0002h
PORTB_CMP2_POSITION                      equ 0002h
PORTB_CMP2_SIZE                          equ 0001h
PORTB_CMP2_LENGTH                        equ 0001h
PORTB_CMP2_MASK                          equ 0004h
PORTB_CMP1_POSN                          equ 0003h
PORTB_CMP1_POSITION                      equ 0003h
PORTB_CMP1_SIZE                          equ 0001h
PORTB_CMP1_LENGTH                        equ 0001h
PORTB_CMP1_MASK                          equ 0008h
PORTB_T1OSO_POSN                         equ 0002h
PORTB_T1OSO_POSITION                     equ 0002h
PORTB_T1OSO_SIZE                         equ 0001h
PORTB_T1OSO_LENGTH                       equ 0001h
PORTB_T1OSO_MASK                         equ 0004h
PORTB_T1OSI_POSN                         equ 0003h
PORTB_T1OSI_POSITION                     equ 0003h
PORTB_T1OSI_SIZE                         equ 0001h
PORTB_T1OSI_LENGTH                       equ 0001h
PORTB_T1OSI_MASK                         equ 0008h
PORTB_T1CKI_POSN                         equ 0002h
PORTB_T1CKI_POSITION                     equ 0002h
PORTB_T1CKI_SIZE                         equ 0001h
PORTB_T1CKI_LENGTH                       equ 0001h
PORTB_T1CKI_MASK                         equ 0004h
PORTB_CCP2_PA2_POSN                      equ 0003h
PORTB_CCP2_PA2_POSITION                  equ 0003h
PORTB_CCP2_PA2_SIZE                      equ 0001h
PORTB_CCP2_PA2_LENGTH                    equ 0001h
PORTB_CCP2_PA2_MASK                      equ 0008h

// Register: OVDCONS
#define OVDCONS OVDCONS
OVDCONS                                  equ 0F82h
// bitfield definitions
OVDCONS_POUT_POSN                        equ 0000h
OVDCONS_POUT_POSITION                    equ 0000h
OVDCONS_POUT_SIZE                        equ 0006h
OVDCONS_POUT_LENGTH                      equ 0006h
OVDCONS_POUT_MASK                        equ 003Fh
OVDCONS_POUT0_POSN                       equ 0000h
OVDCONS_POUT0_POSITION                   equ 0000h
OVDCONS_POUT0_SIZE                       equ 0001h
OVDCONS_POUT0_LENGTH                     equ 0001h
OVDCONS_POUT0_MASK                       equ 0001h
OVDCONS_POUT1_POSN                       equ 0001h
OVDCONS_POUT1_POSITION                   equ 0001h
OVDCONS_POUT1_SIZE                       equ 0001h
OVDCONS_POUT1_LENGTH                     equ 0001h
OVDCONS_POUT1_MASK                       equ 0002h
OVDCONS_POUT2_POSN                       equ 0002h
OVDCONS_POUT2_POSITION                   equ 0002h
OVDCONS_POUT2_SIZE                       equ 0001h
OVDCONS_POUT2_LENGTH                     equ 0001h
OVDCONS_POUT2_MASK                       equ 0004h
OVDCONS_POUT3_POSN                       equ 0003h
OVDCONS_POUT3_POSITION                   equ 0003h
OVDCONS_POUT3_SIZE                       equ 0001h
OVDCONS_POUT3_LENGTH                     equ 0001h
OVDCONS_POUT3_MASK                       equ 0008h
OVDCONS_POUT4_POSN                       equ 0004h
OVDCONS_POUT4_POSITION                   equ 0004h
OVDCONS_POUT4_SIZE                       equ 0001h
OVDCONS_POUT4_LENGTH                     equ 0001h
OVDCONS_POUT4_MASK                       equ 0010h
OVDCONS_POUT5_POSN                       equ 0005h
OVDCONS_POUT5_POSITION                   equ 0005h
OVDCONS_POUT5_SIZE                       equ 0001h
OVDCONS_POUT5_LENGTH                     equ 0001h
OVDCONS_POUT5_MASK                       equ 0020h

// Register: OVDCOND
#define OVDCOND OVDCOND
OVDCOND                                  equ 0F83h
// bitfield definitions
OVDCOND_POVD_POSN                        equ 0000h
OVDCOND_POVD_POSITION                    equ 0000h
OVDCOND_POVD_SIZE                        equ 0006h
OVDCOND_POVD_LENGTH                      equ 0006h
OVDCOND_POVD_MASK                        equ 003Fh
OVDCOND_POVD0_POSN                       equ 0000h
OVDCOND_POVD0_POSITION                   equ 0000h
OVDCOND_POVD0_SIZE                       equ 0001h
OVDCOND_POVD0_LENGTH                     equ 0001h
OVDCOND_POVD0_MASK                       equ 0001h
OVDCOND_POVD1_POSN                       equ 0001h
OVDCOND_POVD1_POSITION                   equ 0001h
OVDCOND_POVD1_SIZE                       equ 0001h
OVDCOND_POVD1_LENGTH                     equ 0001h
OVDCOND_POVD1_MASK                       equ 0002h
OVDCOND_POVD2_POSN                       equ 0002h
OVDCOND_POVD2_POSITION                   equ 0002h
OVDCOND_POVD2_SIZE                       equ 0001h
OVDCOND_POVD2_LENGTH                     equ 0001h
OVDCOND_POVD2_MASK                       equ 0004h
OVDCOND_POVD3_POSN                       equ 0003h
OVDCOND_POVD3_POSITION                   equ 0003h
OVDCOND_POVD3_SIZE                       equ 0001h
OVDCOND_POVD3_LENGTH                     equ 0001h
OVDCOND_POVD3_MASK                       equ 0008h
OVDCOND_POVD4_POSN                       equ 0004h
OVDCOND_POVD4_POSITION                   equ 0004h
OVDCOND_POVD4_SIZE                       equ 0001h
OVDCOND_POVD4_LENGTH                     equ 0001h
OVDCOND_POVD4_MASK                       equ 0010h
OVDCOND_POVD5_POSN                       equ 0005h
OVDCOND_POVD5_POSITION                   equ 0005h
OVDCOND_POVD5_SIZE                       equ 0001h
OVDCOND_POVD5_LENGTH                     equ 0001h
OVDCOND_POVD5_MASK                       equ 0020h

